In [54]:
#import libraries
import pandas as pd

In [55]:
#import data
df_2001 = pd.read_csv('datasets/modified/nap-2001.csv')
df_2011 = pd.read_csv('datasets/modified/nap-2011.csv')

In [56]:
df_2001.head()

,STATISTIC,Statistic Label,C02363V02844,Consumer Item,TLIST(M1),Month,UNIT,VALUE
0,CPM04,National Average Price,10010,Round steak per kg.,200112,2001M12,Euro,8.414
1,CPM04,National Average Price,10010,Round steak per kg.,200201,2002M01,Euro,8.696
2,CPM04,National Average Price,10010,Round steak per kg.,200202,2002M02,Euro,8.643
3,CPM04,National Average Price,10010,Round steak per kg.,200203,2002M03,Euro,8.791
4,CPM04,National Average Price,10010,Round steak per kg.,200204,2002M04,Euro,8.599

In [57]:
df_2011.head()

,STATISTIC,STATISTIC Label,TLIST(M1),Month,C02363V03422,Consumer Item,UNIT,VALUE
0,CPM12,National Average Price,201201,2012 January,10020,"White, self raising flour per 2 kg",Euro,2.130
1,CPM12,National Average Price,201201,2012 January,10030,"Brown, wholemeal flour per 2 kg",Euro,2.495
2,CPM12,National Average Price,201201,2012 January,10040,"Bread, white sliced pan, large (800g)",Euro,1.276
3,CPM12,National Average Price,201201,2012 January,10050,"Bread, brown sliced pan, large (800g)",Euro,1.539
4,CPM12,National Average Price,201201,2012 January,10190,Spaghetti per 500g,Euro,1.202

In [58]:
#remove unnecessary columns
df_2001.drop(['STATISTIC', 'Statistic Label','C02363V02844', 'Month', 'UNIT'], axis=1, inplace=True)

In [59]:
df_2011.drop(['STATISTIC', 'STATISTIC Label','Month', 'C02363V03422', 'UNIT'], axis=1, inplace=True)

In [60]:
df_2001.head()

         Consumer Item  TLIST(M1)  VALUE
0  Round steak per kg.     200112  8.414
1  Round steak per kg.     200201  8.696
2  Round steak per kg.     200202  8.643
3  Round steak per kg.     200203  8.791
4  Round steak per kg.     200204  8.599

In [61]:
df_2011.head()

   TLIST(M1)                          Consumer Item  VALUE
0     201201     White, self raising flour per 2 kg  2.130
1     201201        Brown, wholemeal flour per 2 kg  2.495
2     201201  Bread, white sliced pan, large (800g)  1.276
3     201201  Bread, brown sliced pan, large (800g)  1.539
4     201201                     Spaghetti per 500g  1.202

In [62]:
#rearrange columns to match each other 
df_2001 = df_2001.reindex(columns=['TLIST(M1)','Consumer Item', 'VALUE'])

In [63]:
df_2001.head()

   TLIST(M1)        Consumer Item  VALUE
0     200112  Round steak per kg.  8.414
1     200201  Round steak per kg.  8.696
2     200202  Round steak per kg.  8.643
3     200203  Round steak per kg.  8.791
4     200204  Round steak per kg.  8.599

In [64]:
#rename columns
df_2001.rename(columns={'TLIST(M1)':'Month', 'Consumer Item':'Item', 'VALUE':'Value'}, inplace=True)

In [65]:
df_2001.head()

    Month                 Item  Value
0  200112  Round steak per kg.  8.414
1  200201  Round steak per kg.  8.696
2  200202  Round steak per kg.  8.643
3  200203  Round steak per kg.  8.791
4  200204  Round steak per kg.  8.599

In [66]:
#rename columns
df_2011.rename(columns={'TLIST(M1)':'Month', 'Consumer Item':'Item', 'VALUE':'Value'}, inplace=True)

In [67]:
df_2011.head()

    Month                                   Item  Value
0  201201     White, self raising flour per 2 kg  2.130
1  201201        Brown, wholemeal flour per 2 kg  2.495
2  201201  Bread, white sliced pan, large (800g)  1.276
3  201201  Bread, brown sliced pan, large (800g)  1.539
4  201201                     Spaghetti per 500g  1.202

In [68]:
#output to csv
df_2001.to_csv('datasets/modified/nap-2001-drop-reindex-rename.csv', index=False)
df_2011.to_csv('datasets/modified/nap-2011-drop-reindex-rename.csv', index=False)

In [69]:
#load dataframes again
df_clean = pd.read_csv('datasets/modified/nap-2011-drop-reindex-rename.csv')
df_messy = pd.read_csv('datasets/modified/nap-2001-drop-reindex-rename.csv')

#append the two dataframes (merge them)
df_appended = df_messy.append(df_clean, ignore_index=True)

#sort by Month column
df_appended.sort_values(by=['Month'], inplace=True)

#output the appended dataframe to csv
df_appended.to_csv('datasets/modified/nap-2001-2011-sorted.csv', index=False)

/var/folders/w6/r48h7v_j71v17zq997zw3_yr0000gn/T/ipykernel_52463/3719923600.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_appended = df_messy.append(df_clean, ignore_index=True)

In [71]:
#missing data
#show count of all null values in 2011
df_2011.isnull().sum()

Month      0
Item       0
Value    869
dtype: int64